{
    "commentary_on_process": "",
    "final_answer": "11",
    "gold_correct_answer": {
        "date": {
            "day": "",
            "month": "",
            "year": ""
        },
        "number": "9",
        "spans": []
    },
    "problem_text": "Context:\nBy July 2007, the Shadow platform accumulated 200,000 flight hours, doubling its previous record of 100,000 hours in 13 months. The system then surpassed 300,000 flight hours in April 2008, and by May 2010, the Shadow system had accumulated over 500,000 flight hours. As of 2011, the Shadow had logged over 709,000 hours. The Shadow platform has flown over 37,000 sorties in support of operations in Iraq and Afghanistan by US Army and Army National Guard units. On 6 August 2012, AAI announced that the Shadow had achieved 750,000 flight hours during more than 173,000 missions. More than 900,000 flight hours had been logged by Shadow UAVs by the end of June 2014.\n\nQuestion:\nHow many months did it take the Shadow platform to go from 200000 flight hours to 300000?",
    "question_alone": "How many months did it take the Shadow platform to go from 200000 flight hours to 300000?",
    "solved_correctly": false,
    "steps": [
        {
            "step_response": "11",
            "type_of_step": {
                "is_final": true,
                "name": "Ready to find the final answer",
                "short_name": "final",
                "text": "Given what we know, what is the answer to this problem? Please write the numerical answer and nothing else. Write the answer with digits, like '4' rather than 'four'. Give the final answer only, using as few words as possible."
            },
            "usefulness_commentary": "",
            "was_useful": false
        }
    ],
    "types_of_steps": [
        {
            "is_final": false,
            "name": "Identify relevant information",
            "short_name": "relevant",
            "text": "What information is relevant to the problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify the main question",
            "short_name": "question",
            "text": "What is the main question or goal of the problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify keywords",
            "short_name": "keywords",
            "text": "Are there any keywords or phrases that can help me identify the type of problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Break down the problem",
            "short_name": "break",
            "text": "Please break down the problem into smaller, more manageable parts Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify patterns",
            "short_name": "patterns",
            "text": "Identify any patterns or relationships between the given information that can help me solve the problem Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Rephrase the problem",
            "short_name": "rephrase",
            "text": "Rephrase the problem in your own words to ensure you understand it Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Use similar problems",
            "short_name": "similar",
            "text": "Are there any similar problems that I've solved before that could help guide me? If so, describe them. Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Make a list or table",
            "short_name": "list",
            "text": "Can I make a list or table to organize the given information? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Convert units",
            "short_name": "measurement",
            "text": "What units or measurements are being used, and do I need to convert any of them? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Make assumptions",
            "short_name": "assumptions",
            "text": "Are there any assumptions I need to make, or are there any constraints I should consider? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Try a different approach",
            "short_name": "different",
            "text": "Should I try a different approach if my current strategy is not working? If so, what would be a better approach? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Estimate the answer",
            "short_name": "estimate",
            "text": "Can I estimate the answer to check if my solution is reasonable? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Double-check",
            "short_name": "double",
            "text": "Have I double-checked my calculations and solution for accuracy? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Choose a strategy",
            "short_name": "strategy",
            "text": "What is the best strategy to solve this problem? Describe it. Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify the obvious answer",
            "short_name": "obvious",
            "text": "What is the obvious answer to this problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Do math",
            "short_name": "math",
            "text": "Step through the math to solve this problem. Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Look for a clever trick",
            "short_name": "trick",
            "text": "I think there might be a clever trick for solving this problem. What is it? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Think about background",
            "short_name": "background",
            "text": "What background information do we know that might help us solve this problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": true,
            "name": "Ready to find the final answer",
            "short_name": "final",
            "text": "Given what we know, what is the answer to this problem? Please write the numerical answer and nothing else. Write the answer with digits, like '4' rather than 'four'. Give the final answer only, using as few words as possible."
        },
        {
            "is_final": false,
            "name": "Summarize what we've done so far",
            "short_name": "summarize",
            "text": "Please summarize what we've done so far. Please be concise and professional. Do only this step and do not jump ahead."
        }
    ]
}