{
    "commentary_on_process": "",
    "final_answer": "82",
    "gold_correct_answer": {
        "date": {
            "day": "",
            "month": "",
            "year": ""
        },
        "number": "",
        "spans": [
            "82-yard touchdown"
        ]
    },
    "problem_text": "Context:\nIn week 10, Green Bay traveled to the Metrodome to face the Minnesota Vikings. The winner of the game would take second place in the NFC North. The Packers were able to score early in the first quarter with a field goal by Dave Rayner. Shortly after, Packer linebacker Brady Poppinga sacked Vikings quarterback Brad Johnson causing him to fumble; the Packers recovered the ball. The fumble set up a Brett Favre touchdown pass to Noah Herron. The Vikings were able to take the lead with two touchdowns, one a 40-yard touchdown pass to Billy McMullen. With under two minutes remaining in the half, the Packers regained the lead when Brett Favre threw an 82-yard touchdown pass to wide receiver Donald Driver. The Packers would hold the lead for the rest of the game. Brett Favre finished the game with 347&#160;yards, two touchdowns, and no interceptions. Receiver Donald Driver had six catches for 191&#160;yards. Vikings quarterback Brad Johnson threw for 257&#160;yards, one touchdown, and one interception. Packer kicker Dave Rayner made three field goals in three attempts. A. J. Hawk was named NFL Rookie of the Week for his performance. He recorded 13 tackles, one forced fumble, and 1.5 sacks.\n\nQuestion:\nHow long was Brett Favre longest pass touchdown?",
    "question_alone": "How long was Brett Favre longest pass touchdown?",
    "solved_correctly": false,
    "steps": [
        {
            "step_response": "82",
            "type_of_step": {
                "is_final": true,
                "name": "Ready to find the final answer",
                "short_name": "final",
                "text": "Given what we know, what is the answer to this problem? Please write the numerical answer and nothing else. Write the answer with digits, like '4' rather than 'four'. Give the final answer only, using as few words as possible."
            },
            "usefulness_commentary": "",
            "was_useful": false
        }
    ],
    "types_of_steps": [
        {
            "is_final": false,
            "name": "Identify relevant information",
            "short_name": "relevant",
            "text": "What information is relevant to the problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify the main question",
            "short_name": "question",
            "text": "What is the main question or goal of the problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify keywords",
            "short_name": "keywords",
            "text": "Are there any keywords or phrases that can help me identify the type of problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Break down the problem",
            "short_name": "break",
            "text": "Please break down the problem into smaller, more manageable parts Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify patterns",
            "short_name": "patterns",
            "text": "Identify any patterns or relationships between the given information that can help me solve the problem Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Rephrase the problem",
            "short_name": "rephrase",
            "text": "Rephrase the problem in your own words to ensure you understand it Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Use similar problems",
            "short_name": "similar",
            "text": "Are there any similar problems that I've solved before that could help guide me? If so, describe them. Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Make a list or table",
            "short_name": "list",
            "text": "Can I make a list or table to organize the given information? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Convert units",
            "short_name": "measurement",
            "text": "What units or measurements are being used, and do I need to convert any of them? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Make assumptions",
            "short_name": "assumptions",
            "text": "Are there any assumptions I need to make, or are there any constraints I should consider? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Try a different approach",
            "short_name": "different",
            "text": "Should I try a different approach if my current strategy is not working? If so, what would be a better approach? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Estimate the answer",
            "short_name": "estimate",
            "text": "Can I estimate the answer to check if my solution is reasonable? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Double-check",
            "short_name": "double",
            "text": "Have I double-checked my calculations and solution for accuracy? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Choose a strategy",
            "short_name": "strategy",
            "text": "What is the best strategy to solve this problem? Describe it. Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify the obvious answer",
            "short_name": "obvious",
            "text": "What is the obvious answer to this problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Do math",
            "short_name": "math",
            "text": "Step through the math to solve this problem. Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Look for a clever trick",
            "short_name": "trick",
            "text": "I think there might be a clever trick for solving this problem. What is it? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Think about background",
            "short_name": "background",
            "text": "What background information do we know that might help us solve this problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": true,
            "name": "Ready to find the final answer",
            "short_name": "final",
            "text": "Given what we know, what is the answer to this problem? Please write the numerical answer and nothing else. Write the answer with digits, like '4' rather than 'four'. Give the final answer only, using as few words as possible."
        },
        {
            "is_final": false,
            "name": "Summarize what we've done so far",
            "short_name": "summarize",
            "text": "Please summarize what we've done so far. Please be concise and professional. Do only this step and do not jump ahead."
        }
    ]
}