{
    "commentary_on_process": "",
    "final_answer": "Matt Prater made field goals of 43, 34, and 33 yards.",
    "gold_correct_answer": {
        "date": {
            "day": "",
            "month": "",
            "year": ""
        },
        "number": "",
        "spans": [
            "43",
            "34",
            "20-yard",
            "33-yard"
        ]
    },
    "problem_text": "Context:\nHoping to add to a seven-game winning streak, the Broncos traveled to the O.co Coliseum for an AFC West rematch with the Oakland Raiders. The Broncos jumped out to a 13-0 lead, with quarterback Peyton Manning throwing a 6-yard touchdown pass to tight end Joel Dreessen, followed by field goals of 43 and 34 from placekicker Matt Prater, with the latter field goal occurring early in the second quarter. The Raiders got on the scoreboard late in the first half, with quarterback Carson Palmer throwing a 6-yard touchdown pass to running back Darren McFadden. The Broncos added to their lead in the third quarter, with a 20-yard field goal by Prater, a 1-yard touchdown run by running back Knowshon Moreno and a 33-yard field goal by Prater. A 56-yard touchdown pass from Palmer to wide receiver Darrius Heyward-Bey (with a failed two-point conversion attempt) was the only scoring play of the fourth quarter, and the Broncos ran out the final 5:36 of the game. With the win, the Broncos earned their first season sweep of the Raiders since 2006, and also swept their division rivals on the road for the third time in four seasons.\n\nQuestion:\nWhich field goals did Matt Prater make?",
    "question_alone": "Which field goals did Matt Prater make?",
    "solved_correctly": false,
    "steps": [
        {
            "step_response": "Matt Prater made field goals of 43, 34, and 33 yards.",
            "type_of_step": {
                "is_final": true,
                "name": "Ready to find the final answer",
                "short_name": "final",
                "text": "Given what we know, what is the answer to this problem? Please write the numerical answer and nothing else. Write the answer with digits, like '4' rather than 'four'. Give the final answer only, using as few words as possible."
            },
            "usefulness_commentary": "",
            "was_useful": false
        }
    ],
    "types_of_steps": [
        {
            "is_final": false,
            "name": "Identify relevant information",
            "short_name": "relevant",
            "text": "What information is relevant to the problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify the main question",
            "short_name": "question",
            "text": "What is the main question or goal of the problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify keywords",
            "short_name": "keywords",
            "text": "Are there any keywords or phrases that can help me identify the type of problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Break down the problem",
            "short_name": "break",
            "text": "Please break down the problem into smaller, more manageable parts Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify patterns",
            "short_name": "patterns",
            "text": "Identify any patterns or relationships between the given information that can help me solve the problem Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Rephrase the problem",
            "short_name": "rephrase",
            "text": "Rephrase the problem in your own words to ensure you understand it Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Use similar problems",
            "short_name": "similar",
            "text": "Are there any similar problems that I've solved before that could help guide me? If so, describe them. Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Make a list or table",
            "short_name": "list",
            "text": "Can I make a list or table to organize the given information? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Convert units",
            "short_name": "measurement",
            "text": "What units or measurements are being used, and do I need to convert any of them? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Make assumptions",
            "short_name": "assumptions",
            "text": "Are there any assumptions I need to make, or are there any constraints I should consider? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Try a different approach",
            "short_name": "different",
            "text": "Should I try a different approach if my current strategy is not working? If so, what would be a better approach? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Estimate the answer",
            "short_name": "estimate",
            "text": "Can I estimate the answer to check if my solution is reasonable? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Double-check",
            "short_name": "double",
            "text": "Have I double-checked my calculations and solution for accuracy? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Choose a strategy",
            "short_name": "strategy",
            "text": "What is the best strategy to solve this problem? Describe it. Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Identify the obvious answer",
            "short_name": "obvious",
            "text": "What is the obvious answer to this problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Do math",
            "short_name": "math",
            "text": "Step through the math to solve this problem. Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Look for a clever trick",
            "short_name": "trick",
            "text": "I think there might be a clever trick for solving this problem. What is it? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": false,
            "name": "Think about background",
            "short_name": "background",
            "text": "What background information do we know that might help us solve this problem? Please be concise and professional. Do only this step and do not jump ahead."
        },
        {
            "is_final": true,
            "name": "Ready to find the final answer",
            "short_name": "final",
            "text": "Given what we know, what is the answer to this problem? Please write the numerical answer and nothing else. Write the answer with digits, like '4' rather than 'four'. Give the final answer only, using as few words as possible."
        },
        {
            "is_final": false,
            "name": "Summarize what we've done so far",
            "short_name": "summarize",
            "text": "Please summarize what we've done so far. Please be concise and professional. Do only this step and do not jump ahead."
        }
    ]
}